---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.FloorFailures
source: html/079a19e9-d489-0916-bb68-1e57415def33.htm
---
# BuiltInFailures.FloorFailures Properties

Thickness of this Floor may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in
 sections and details may not accurately indicate the Thickness shown in Type Properties.